In [10]:
import numpy as npy
import pandas as pds
import random

In [11]:
first_series = [[random.randint(1, 4)] for i in range(100)]
df_first = pds.DataFrame(first_series)
df_first

    0
0   3
1   4
2   2
3   4
4   4
.. ..
95  4
96  3
97  3
98  3
99  4

[100 rows x 1 columns]

In [12]:
second_series = [[random.randint(1, 3)] for i in range(100)]
df_second = pds.DataFrame(second_series)
df_second

    0
0   1
1   3
2   1
3   1
4   1
.. ..
95  3
96  2
97  3
98  2
99  1

[100 rows x 1 columns]

In [13]:
third_series = [[random.randint(10000, 30000)] for i in range(100)]
df_third = pds.DataFrame(third_series)
df_third

        0
0   13623
1   23429
2   18160
3   20524
4   15703
..    ...
95  20901
96  17762
97  15960
98  22602
99  22929

[100 rows x 1 columns]

In [14]:
df = pds.concat([df_first, df_second, df_third], axis=1)
df

    0  0      0
0   3  1  13623
1   4  3  23429
2   2  1  18160
3   4  1  20524
4   4  1  15703
.. .. ..    ...
95  4  3  20901
96  3  2  17762
97  3  3  15960
98  3  2  22602
99  4  1  22929

[100 rows x 3 columns]

In [15]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       1            13623
1       4       3            23429
2       2       1            18160
3       4       1            20524
4       4       1            15703
..    ...     ...              ...
95      4       3            20901
96      3       2            17762
97      3       3            15960
98      3       2            22602
99      4       1            22929

[100 rows x 3 columns]

In [16]:
df_new = df.bedrs.astype(str).str.cat(df.bathrs.astype(str)).str.cat(df.price_sqr_meter.astype(str))
df_new.columns = ['bigcolumn']
df_new

0     3113623
1     4323429
2     2118160
3     4120524
4     4115703
       ...
95    4320901
96    3217762
97    3315960
98    3222602
99    4122929
Name: bedrs, Length: 100, dtype: object

In [17]:
print(df_new)

0     3113623
1     4323429
2     2118160
3     4120524
4     4115703
       ...
95    4320901
96    3217762
97    3315960
98    3222602
99    4122929
Name: bedrs, Length: 100, dtype: object

In [18]:
df_new.reset_index()
df_new.reindex(index=range(0,299))

0      3113623
1      4323429
2      2118160
3      4120524
4      4115703
        ...
294        NaN
295        NaN
296        NaN
297        NaN
298        NaN
Name: bedrs, Length: 299, dtype: object